# CannotCreateOpeningCutOut Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateOpeningCutOut Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't create Opening cut.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateOpeningCutOut { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateOpeningCutOut As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateOpeningCutOut {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace